In [4]:
#Importando o pandas
import pandas as pd

In [13]:
#Abrindo o arquivo csv
df = pd.read_csv("tabela.csv", encoding="UTF-8")
df2 = pd.read_csv("tabela2.csv", encoding="UTF-8")

In [22]:
df_resultante = pd.concat([df,df2], axis = 0, ignore_index = True)

In [23]:
df_resultante.head()

          Nome  Idade Sexo
0          Leo     21    M
1  Luiz Carlos     50    M
2      Juninho     51    M
3      Heuller     21    M
4         Alan     22    F